menu

spのプログラム

sp1
ライン中央にオブジェクト。運ぶ
スタートアンドフィニッシュエリアにゴールする
⇨結構使える
sp2
クレーンにオブジェを載せる
ロボットの変更必要。
アームでオブジェを置いた後、船で押してクレーンを動かす

sp3
最後までサプライズ系（location_fourにある）を持っている必要がある場合のcheck_pattern
big_shipのarmを下ろす方法。（上記にある優先の付け方の時。）
small_shipは同様にして当日作成。

sp4
whiteのサプライズにより色が変わった場合の処理。
whiteの色を読んでとってくれる。

sp5
緑が一つ黄色になる。足し算の結果が変わるobj_knowが変化する
small_shipのケミカル。　結構使えそう!!。

sp6
スタートがランダム。　超音波必須アイテム超音波を使うので設定を2行変更する必要がある。
スタートエリアの後ろにオブジェクト二つ。
引きずり運ぶシステム採用。set_A145で引きずります。


sp7　スタートエリアが変わるならこっちを使って！！！！
スタートがmooring area.　スタートが変わる、また、ゴール地点からスタート地点に行きたい場合はsp7が良い。（spオブジェがある前提なので注意）
bigshipの後に船イラストのところにspオブジェを置きにいく。そのまま、完全ゴール状態に持っていく。
引きずってオブジェを持ち、130度、130の時だけpower = 10になってる

sp8
fuelを運んでビッグシップの後ろに乗っける。
ゴールする前に、障害物が置かれていたところに置かれるコンテナを取りに行ってゴールする


当日運用

1.ロボットの修理、確認
  アームが緩んでいないか
  コードが抜けていたり、どこかに引っかかったりしていないか
  タイヤの汚れ具合
  ゴム
  後ろアームのチェック
  パーツが取れそうになっていないか
2.コースとロボットのチェック
  影響が怖いのはオブジェの読みと、ライントレース。
  オブジェの読みは走らせながら確認する
  試走する。（6パターン）
 6パターンを最初に試して、6個めは最後まで行くようにして周り見ながら考える。
  クレーンのゴムのゆるさによってビッグシップに赤コンテナに触れないか確かめる
BB BBGG
BB GGBB
BB GBBG
GG GBBG
GG BGBG
GG GBGB
できる限り試したいパターン

3.サプライズを組む
  基本2人で組む
  試走する
  ミスはホワイトボードにメモる。
